----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1              [1, 256, 292]          20,736
              Conv-2              [1, 256, 292]               0
            Conv1d-3              [1, 256, 292]          65,792
       BatchNorm1d-4              [1, 256, 292]             512
            Conv1d-5              [1, 256, 293]         131,328
       BatchNorm1d-6              [1, 256, 292]             512
            Conv1d-7              [1, 256, 292]         196,864
       BatchNorm1d-8              [1, 256, 292]             512
            Conv1d-9              [1, 256, 293]         262,400
      BatchNorm1d-10              [1, 256, 292]             512
           Conv1d-11              [1, 256, 292]         327,936
      BatchNorm1d-12              [1, 256, 292]             512
           Conv1d-13              [1, 256, 293]         393,472
      BatchNorm1d-14              [1, 256, 292]             512
           Conv1d-15              [1, 256, 292]         459,008
      BatchNorm1d-16              [1, 256, 292]             512
           Conv1d-17              [1, 256, 293]         524,544
      BatchNorm1d-18              [1, 256, 292]             512
           Conv1d-19              [1, 256, 292]         590,080
      BatchNorm1d-20              [1, 256, 292]             512
           Conv1d-21              [1, 256, 293]         655,616
      BatchNorm1d-22              [1, 256, 292]             512
           Conv1d-23              [1, 256, 292]         721,152
      BatchNorm1d-24              [1, 256, 292]             512
           Conv1d-25              [1, 256, 293]         786,688
      BatchNorm1d-26              [1, 256, 292]             512
           Conv1d-27              [1, 256, 292]         852,224
      BatchNorm1d-28              [1, 256, 292]             512
           Conv1d-29              [1, 256, 293]         917,760
      BatchNorm1d-30              [1, 256, 292]             512
           Conv1d-31              [1, 256, 292]         983,296
      BatchNorm1d-32              [1, 256, 292]             512
           Conv1d-33              [1, 256, 293]       1,048,832
      BatchNorm1d-34              [1, 256, 292]             512
        MaxPool1d-35             [1, 4096, 293]               0
           Conv1d-36              [1, 256, 292]       3,145,984
      BatchNorm1d-37              [1, 256, 292]             512
           Conv1d-38              [1, 256, 292]         196,864
      BatchNorm1d-39              [1, 256, 292]             512
           Linear-40              [1, 292, 256]          65,792
           Linear-41              [1, 292, 256]          65,792
           Linear-42              [1, 292, 256]          65,792
           Linear-43              [1, 292, 256]          65,792
           Linear-44              [1, 292, 256]          65,792
           Linear-45              [1, 292, 256]          65,792
           Linear-46              [1, 292, 256]          65,792
           Linear-47              [1, 292, 256]          65,792
              GRU-48  [[-1, 292, 256], [-1, 2, 128]]               0
             CBHG-49              [1, 292, 256]               0
           Conv1d-50             [1, 1025, 292]         263,425
             Conv-51             [1, 1025, 292]               0
================================================================
Total params: 13,079,553
Trainable params: 13,079,553
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.09
Forward/backward pass size (MB): 186.54
Params size (MB): 49.89
Estimated Total Size (MB): 236.53
----------------------------------------------------------------