----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Linear-1                [1, 2, 512]          41,472
            Linear-2                [1, 2, 512]               0
              ReLU-3                [1, 2, 512]               0
           Dropout-4                [1, 2, 512]               0
            Linear-5                [1, 2, 256]         131,328
            Linear-6                [1, 2, 256]               0
              ReLU-7                [1, 2, 256]               0
           Dropout-8                [1, 2, 256]               0
            Linear-9                [1, 2, 256]          65,792
           Linear-10                [1, 2, 256]               0
           Prenet-11                [1, 2, 256]               0
           Linear-12                [1, 2, 256]          65,792
           Linear-13                [1, 2, 256]               0
        Embedding-14                [1, 2, 256]         262,144
          Dropout-15                [1, 2, 256]               0
           Linear-16                [1, 2, 256]          65,536
           Linear-17                [1, 2, 256]               0
           Linear-18                [1, 2, 256]          65,536
           Linear-19                [1, 2, 256]               0
           Linear-20                [1, 2, 256]          65,536
           Linear-21                [1, 2, 256]               0
MultiheadAttention-22  [[-1, 2, 64], [-1, 2, 2]]               0
           Linear-23                [1, 2, 256]         131,328
           Linear-24                [1, 2, 256]               0
        LayerNorm-25                [1, 2, 256]             512
        Attention-26  [[-1, 2, 256], [-1, 2, 2]]               0
           Conv1d-27               [1, 1024, 2]         263,168
             Conv-28               [1, 1024, 2]               0
           Conv1d-29                [1, 256, 2]         262,400
             Conv-30                [1, 256, 2]               0
        LayerNorm-31                [1, 2, 256]             512
              FFN-32                [1, 2, 256]               0
           Linear-33                [1, 2, 256]          65,536
           Linear-34                [1, 2, 256]               0
           Linear-35                [1, 2, 256]          65,536
           Linear-36                [1, 2, 256]               0
           Linear-37                [1, 2, 256]          65,536
           Linear-38                [1, 2, 256]               0
MultiheadAttention-39  [[-1, 2, 64], [-1, 2, 2]]               0
           Linear-40                [1, 2, 256]         131,328
           Linear-41                [1, 2, 256]               0
        LayerNorm-42                [1, 2, 256]             512
        Attention-43  [[-1, 2, 256], [-1, 2, 2]]               0
           Conv1d-44               [1, 1024, 2]         263,168
             Conv-45               [1, 1024, 2]               0
           Conv1d-46                [1, 256, 2]         262,400
             Conv-47                [1, 256, 2]               0
        LayerNorm-48                [1, 2, 256]             512
              FFN-49                [1, 2, 256]               0
           Linear-50                [1, 2, 256]          65,536
           Linear-51                [1, 2, 256]               0
           Linear-52                [1, 2, 256]          65,536
           Linear-53                [1, 2, 256]               0
           Linear-54                [1, 2, 256]          65,536
           Linear-55                [1, 2, 256]               0
MultiheadAttention-56  [[-1, 2, 64], [-1, 2, 2]]               0
           Linear-57                [1, 2, 256]         131,328
           Linear-58                [1, 2, 256]               0
        LayerNorm-59                [1, 2, 256]             512
        Attention-60  [[-1, 2, 256], [-1, 2, 2]]               0
           Conv1d-61               [1, 1024, 2]         263,168
             Conv-62               [1, 1024, 2]               0
           Conv1d-63                [1, 256, 2]         262,400
             Conv-64                [1, 256, 2]               0
        LayerNorm-65                [1, 2, 256]             512
              FFN-66                [1, 2, 256]               0
           Linear-67                [1, 2, 512]          41,472
           Linear-68                [1, 2, 512]               0
             ReLU-69                [1, 2, 512]               0
          Dropout-70                [1, 2, 512]               0
           Linear-71                [1, 2, 256]         131,328
           Linear-72                [1, 2, 256]               0
             ReLU-73                [1, 2, 256]               0
          Dropout-74                [1, 2, 256]               0
           Linear-75                [1, 2, 256]          65,792
           Linear-76                [1, 2, 256]               0
           Prenet-77                [1, 2, 256]               0
           Linear-78                [1, 2, 256]          65,792
           Linear-79                [1, 2, 256]               0
        Embedding-80                [1, 2, 256]         262,144
          Dropout-81                [1, 2, 256]               0
           Linear-82                [1, 2, 256]          65,536
           Linear-83                [1, 2, 256]               0
           Linear-84                [1, 2, 256]          65,536
           Linear-85                [1, 2, 256]               0
           Linear-86                [1, 2, 256]          65,536
           Linear-87                [1, 2, 256]               0
MultiheadAttention-88  [[-1, 2, 64], [-1, 2, 2]]               0
           Linear-89                [1, 2, 256]         131,328
           Linear-90                [1, 2, 256]               0
        LayerNorm-91                [1, 2, 256]             512
        Attention-92  [[-1, 2, 256], [-1, 2, 2]]               0
           Linear-93                [1, 2, 256]          65,536
           Linear-94                [1, 2, 256]               0
           Linear-95                [1, 2, 256]          65,536
           Linear-96                [1, 2, 256]               0
           Linear-97                [1, 2, 256]          65,536
           Linear-98                [1, 2, 256]               0
MultiheadAttention-99  [[-1, 2, 64], [-1, 2, 2]]               0
          Linear-100                [1, 2, 256]         131,328
          Linear-101                [1, 2, 256]               0
       LayerNorm-102                [1, 2, 256]             512
       Attention-103  [[-1, 2, 256], [-1, 2, 2]]               0
          Conv1d-104               [1, 1024, 2]         263,168
            Conv-105               [1, 1024, 2]               0
          Conv1d-106                [1, 256, 2]         262,400
            Conv-107                [1, 256, 2]               0
       LayerNorm-108                [1, 2, 256]             512
             FFN-109                [1, 2, 256]               0
          Linear-110                [1, 2, 256]          65,536
          Linear-111                [1, 2, 256]               0
          Linear-112                [1, 2, 256]          65,536
          Linear-113                [1, 2, 256]               0
          Linear-114                [1, 2, 256]          65,536
          Linear-115                [1, 2, 256]               0
MultiheadAttention-116  [[-1, 2, 64], [-1, 2, 2]]               0
          Linear-117                [1, 2, 256]         131,328
          Linear-118                [1, 2, 256]               0
       LayerNorm-119                [1, 2, 256]             512
       Attention-120  [[-1, 2, 256], [-1, 2, 2]]               0
          Linear-121                [1, 2, 256]          65,536
          Linear-122                [1, 2, 256]               0
          Linear-123                [1, 2, 256]          65,536
          Linear-124                [1, 2, 256]               0
          Linear-125                [1, 2, 256]          65,536
          Linear-126                [1, 2, 256]               0
MultiheadAttention-127  [[-1, 2, 64], [-1, 2, 2]]               0
          Linear-128                [1, 2, 256]         131,328
          Linear-129                [1, 2, 256]               0
       LayerNorm-130                [1, 2, 256]             512
       Attention-131  [[-1, 2, 256], [-1, 2, 2]]               0
          Conv1d-132               [1, 1024, 2]         263,168
            Conv-133               [1, 1024, 2]               0
          Conv1d-134                [1, 256, 2]         262,400
            Conv-135                [1, 256, 2]               0
       LayerNorm-136                [1, 2, 256]             512
             FFN-137                [1, 2, 256]               0
          Linear-138                [1, 2, 256]          65,536
          Linear-139                [1, 2, 256]               0
          Linear-140                [1, 2, 256]          65,536
          Linear-141                [1, 2, 256]               0
          Linear-142                [1, 2, 256]          65,536
          Linear-143                [1, 2, 256]               0
MultiheadAttention-144  [[-1, 2, 64], [-1, 2, 2]]               0
          Linear-145                [1, 2, 256]         131,328
          Linear-146                [1, 2, 256]               0
       LayerNorm-147                [1, 2, 256]             512
       Attention-148  [[-1, 2, 256], [-1, 2, 2]]               0
          Linear-149                [1, 2, 256]          65,536
          Linear-150                [1, 2, 256]               0
          Linear-151                [1, 2, 256]          65,536
          Linear-152                [1, 2, 256]               0
          Linear-153                [1, 2, 256]          65,536
          Linear-154                [1, 2, 256]               0
MultiheadAttention-155  [[-1, 2, 64], [-1, 2, 2]]               0
          Linear-156                [1, 2, 256]         131,328
          Linear-157                [1, 2, 256]               0
       LayerNorm-158                [1, 2, 256]             512
       Attention-159  [[-1, 2, 256], [-1, 2, 2]]               0
          Conv1d-160               [1, 1024, 2]         263,168
            Conv-161               [1, 1024, 2]               0
          Conv1d-162                [1, 256, 2]         262,400
            Conv-163                [1, 256, 2]               0
       LayerNorm-164                [1, 2, 256]             512
             FFN-165                [1, 2, 256]               0
          Linear-166                 [1, 2, 80]          20,560
          Linear-167                 [1, 2, 80]               0
          Conv1d-168                [1, 256, 6]         102,656
            Conv-169                [1, 256, 6]               0
     BatchNorm1d-170                [1, 256, 2]             512
         Dropout-171                [1, 256, 2]               0
          Conv1d-172                [1, 256, 6]         327,936
            Conv-173                [1, 256, 6]               0
     BatchNorm1d-174                [1, 256, 2]             512
         Dropout-175                [1, 256, 2]               0
          Conv1d-176                [1, 256, 6]         327,936
            Conv-177                [1, 256, 6]               0
     BatchNorm1d-178                [1, 256, 2]             512
         Dropout-179                [1, 256, 2]               0
          Conv1d-180                [1, 256, 6]         327,936
            Conv-181                [1, 256, 6]               0
     BatchNorm1d-182                [1, 256, 2]             512
         Dropout-183                [1, 256, 2]               0
          Conv1d-184                 [1, 80, 6]         102,480
            Conv-185                 [1, 80, 6]               0
     PostConvNet-186                 [1, 80, 2]               0
          Linear-187                  [1, 2, 1]             257
          Linear-188                  [1, 2, 1]               0
================================================================
Total params: 8,457,377
Trainable params: 7,933,089
Non-trainable params: 524,288
----------------------------------------------------------------
Input size (MB): 0.10
Forward/backward pass size (MB): 1.06
Params size (MB): 32.26
Estimated Total Size (MB): 33.42
----------------------------------------------------------------